# CanHaveAnnotationCrop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewCropRegionShapeManager..::..CanHaveAnnotationCrop Property
ViewCropRegionShapeManager Class See Also
---
Verifies that the view is allowed to have an annotation crop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool CanHaveAnnotationCrop { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CanHaveAnnotationCrop As Boolean
	Get
```

Visual C++
---
```text
public:
property bool CanHaveAnnotationCrop {
	bool get ();
}
```

# See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace